category_general = [
    {
        "id": 1,
        "question": "1 + 1 เท่ากับเท่าไร?",
        "choices": ["1", "2", "3", "4"],
        "answer": "2",
        "hint": "นิ้วมือข้างหนึ่งมี 5 นิ้ว หักออกไป 3"
    },
    {
        "id": 2,
        "question": "ดาวเคราะห์ดวงใดที่มีขนาดใหญ่ที่สุดในระบบสุริยะ?",
        "choices": ["โลก", "ดาวอังคาร", "ดาวพฤหัสบดี", "ดาวเสาร์"],
        "answer": "ดาวพฤหัสบดี",
        "hint": "เป็นดาวก๊าซยักษ์ที่มีจุดแดงใหญ่"
    },
    {
        "id": 3,
        "question": "สัญลักษณ์ทางเคมีของ 'น้ำ' คืออะไร?",
        "choices": ["CO2", "H2O", "O2", "NaCl"],
        "answer": "H2O",
        "hint": "ประกอบด้วยไฮโดรเจน 2 ส่วน และออกซิเจน 1 ส่วน"
    },
    {
        "id": 4,
        "question": "สกุลเงินที่ใช้ในประเทศญี่ปุ่นคืออะไร?",
        "choices": ["วอน", "หยวน", "ดอลลาร์", "เยน"],
        "answer": "เยน",
        "hint": "ตัวย่อภาษาอังกฤษคือ JPY"
    },
    {
        "id": 5,
        "question": "ทวีปที่ใหญ่ที่สุดในโลกคือทวีปอะไร?",
        "choices": ["เอเชีย", "แอฟริกา", "ยุโรป", "อเมริกาเหนือ"],
        "answer": "เอเชีย",
        "hint": "เป็นทวีปที่ประเทศไทยตั้งอยู่"
    },
    {
        "id": 6,
        "question": "อวัยวะใดในร่างกายมนุษย์ที่ทำหน้าที่สูบฉีดเลือด?",
        "choices": ["ปอด", "ตับ", "หัวใจ", "สมอง"],
        "answer": "หัวใจ",
        "hint": "เต้นอยู่ทางหน้าอกด้านซ้าย"
    },
    {
        "id": 7,
        "question": "ก๊าซชนิดใดที่มนุษย์ใช้ในการหายใจเข้า?",
        "choices": ["ไนโตรเจน", "คาร์บอนไดออกไซด์", "ออกซิเจน", "ไฮโดรเจน"],
        "answer": "ออกซิเจน",
        "hint": "เป็นก๊าซที่ต้นไม้ปล่อยออกมาในตอนกลางวัน"
    },
    {
        "id": 8,
        "question": "กำแพงเมืองจีนสร้างขึ้นเพื่อวัตถุประสงค์หลักคืออะไร?",
        "choices": ["เป็นทางเดินรถ", "ป้องกันการรุกราน", "ใช้กักเก็บน้ำ", "เป็นที่อยู่อาศัย"],
        "answer": "ป้องกันการรุกราน",
        "hint": "สร้างขึ้นเพื่อป้องกันศัตรูจากทางเหนือในสมัยโบราณ"
    },
    {
        "id": 9,
        "question": "ผลไม้ชนิดใดที่ได้รับการขนานนามว่าเป็น 'ราชาแห่งผลไม้'?",
        "choices": ["มังคุด", "ทุเรียน", "มะม่วง", "สับปะรด"],
        "answer": "ทุเรียน",
        "hint": "มีเปลือกเป็นหนามแหลมและมีกลิ่นเป็นเอกลักษณ์"
    },
    {
        "id": 10,
        "question": "จังหวัดใดที่มีพื้นที่มากที่สุดในประเทศไทย?",
        "choices": ["เชียงใหม่", "กรุงเทพฯ", "นครราชสีมา", "กาญจนบุรี"],
        "answer": "นครราชสีมา",
        "hint": "เรียกอีกชื่อหนึ่งว่า 'โคราช'"
    }
]


category_it = [
    {
        "id": 1,
        "question": "ภาษาโปรแกรมใดที่ใช้สัญลักษณ์งูเป็นโลโก้?",
        "choices": ["Java", "C++", "Python", "Ruby"],
        "answer": "Python",
        "hint": "ชื่อเหมือนงูเหลือมขนาดใหญ่"
    }
]